[
  {
    "name": "36 questions that lead to love",
    "questions": [
      {
        "number": 1,
        "text": "Given the choice of anyone in the world, whom would you want as a dinner guest?"
      },
      {
        "number": 2,
        "text": "Would you like to be famous? In what way?"
      },
      {
        "number": 3,
        "text": "Before making a telephone call, do you ever rehearse what you are going to say? Why?"
      },
      {
        "number": 4,
        "text": "What could constitute a 'perfect' day for you?"
      },
      {
        "number": 5,
        "text": "When did you last sing to yourself? To someone else?"
      },
      {
        "number": 6,
        "text": "If you were able to live to the age of 90 and retain either the mind or body of a 30-year-old for the last 60 years of your life, which would you want?"
      },
      {
        "number": 7,
        "text": "Do you have a secret hunch about how you will die?"
      },
      {
        "number": 8,
        "text": "Name three things you and your partner (the person you are dating) appear to have in common?"
      },
      {
        "number": 9,
        "text": "For what in your life do you feel most grateful?"
      },
      {
        "number": 10,
        "text": "If you could change anything about the way you were raised, what would it be?"
      },
      {
        "number": 11,
        "text": "Take 4 minutes and tell your partner your life story in as much detail as possible."
      },
      {
        "number": 12,
        "text": "If you could wake up tomorrow having gained any one quality or ability, what would it be?"
      },
      {
        "number": 13,
        "text": "If a crystal ball could tell you the truth about yourself, your life, the future, or anything else what would you want to know?"
      },
      {
        "number": 14,
        "text": "Is there something that you've dreamed of doing for a long time? Why haven't you done it?"
      },
      {
        "number": 15,
        "text": "What is the greatest accomplishment of your life?"
      },
      {
        "number": 16,
        "text": "What do you value most in a friendship?"
      },
      {
        "number": 17,
        "text": "What is your most treasured memory?"
      },
      {
        "number": 18,
        "text": "What is your most terrible memory?"
      },
      {
        "number": 19,
        "text": "If you knew that in one year you would die suddenly, would you change anything about the way you are now living? Why?"
      },
      {
        "number": 20,
        "text": "What does friendship mean to you?"
      },
      {
        "number": 21,
        "text": "What roles do love and affection play in your life?"
      },
      {
        "number": 22,
        "text": "Alternate sharing something you consider a positive characteristic of your partner (the person you are dating). Share a total of 5 items."
      },
      {
        "number": 23,
        "text": "How close and warm is your family? Do you feel your childhood was happier than most other people's?"
      },
      {
        "number": 24,
        "text": "How do you feel about your relationship with your mother?"
      },
      {
        "number": 25,
        "text": "Make 3 true 'we' statements each. For instance 'We are both in this room feeling...'"
      },
      {
        "number": 26,
        "text": "Complete this sentence: 'I wish I had someone with whom I could share...'"
      },
      {
        "number": 27,
        "text": "If you were going to become a close friend with your partner, please share what would be important for him or her to know."
      },
      {
        "number": 28,
        "text": "Tell your partner what you like about them; be very honest this time saying things that you might not say to someone you've just me."
      },
      {
        "number": 29,
        "text": "Share with your partner an embarrassing moment in your life."
      },
      {
        "number": 30,
        "text": "When did you last cry in front of another person? By yourself?"
      },
      {
        "number": 31,
        "text": "Tell your partner something that you love about them already?"
      },
      {
        "number": 32,
        "text": "What if anything, is too serious to be joked about?"
      },
      {
        "number": 33,
        "text": "If you were to die this evening with no opportunity to communicate with anyone, what would you most regret not having told someone? What haven’t you told them yet?"
      },
      {
        "number": 34,
        "text": "Your house, containing everything you own, catches fire. After saving your loved ones and pets, you have time to safely make a final dash to save any one item. What would it be? Why?"
      },
      {
        "number": 35,
        "text": "Of all the people in your family, whose death would you find most disturbing? Why?"
      },
      {
        "number": 36,
        "text": "Share a personal problem and ask your partner’s advice on how he or she might handle it. Also, as your partner to reflect back to you how you seem to be feeling about the problem you have chosen."
      }
    ]
  },
  {
    "name": "Dreams and future",
    "questions": [
      {
        "number": 1,
        "text": "What are some of the highest-valued things on your bucket list?"
      },
      {
        "number": 2,
        "text": "Do you want kids? If so, what are some of the values you want to instill in them?"
      },
      {
        "number": 3,
        "text": "Where is a place you’ve always wanted to travel?"
      },
      {
        "number": 4,
        "text": "What is something you want to do together that we haven’t?"
      },
      {
        "number": 5,
        "text": "Have you ever wanted to move anywhere else?"
      },
      {
        "number": 6,
        "text": "If you could gain one quality or ability, what would it be?"
      },
      {
        "number": 7,
        "text": "How do you see the future individually and collectively as a couple?"
      },
      {
        "number": 8,
        "text": "What things do you look forward to each day?"
      },
      {
        "number": 9,
        "text": "How do you foresee us resolving our most persistent problems?"
      },
      {
        "number": 10,
        "text": "What are your goals for this relationship?"
      },
      {
        "number": 11,
        "text": "What are you hoping to learn in the coming year?"
      },
      {
        "number": 12,
        "text": "Is there anything you’re hesitant to accomplish that I can help you with?"
      }
    ]
  },
  {
    "name": "Favorites",
    "questions": [
      {
        "number": 1,
        "text": "What is your favorite film?"
      },
      {
        "number": 2,
        "text": "What was your favorite class?"
      },
      {
        "number": 3,
        "text": "What is your favorite book?"
      },
      {
        "number": 4,
        "text": "What is your favorite childhood memory?"
      },
      {
        "number": 5,
        "text": "What is your favorite memory of our relationship?"
      },
      {
        "number": 6,
        "text": "What is your favorite thing about yourself?"
      },
      {
        "number": 7,
        "text": "What is your favorite thing about me?"
      },
      {
        "number": 8,
        "text": "What is your favorite place?"
      },
      {
        "number": 9,
        "text": "What was your favorite part about our first kiss?"
      },
      {
        "number": 10,
        "text": "What was your favorite date we’ve had?"
      },
      {
        "number": 11,
        "text": "What is your favorite TV sitcom?"
      },
      {
        "number": 12,
        "text": "What is your favorite karaoke song?"
      },
      {
        "number": 13,
        "text": "What is your favorite way to communicate?"
      }
    ]
  },
  {
    "name": "Sex and Romance",
    "questions": [
      {
        "number": 1,
        "text": "What was your first sexual experience?"
      },
      {
        "number": 2,
        "text": "When was the first time you fell in love?"
      },
      {
        "number": 3,
        "text": "What are the things you value most from the beginning of our relationship?"
      },
      {
        "number": 4,
        "text": "When did you first know you wanted to be in a relationship with me?"
      },
      {
        "number": 5,
        "text": "Are you satisfied with our chemistry and intimacy?"
      },
      {
        "number": 6,
        "text": "In which situations do you feel most secure in our relationship?"
      },
      {
        "number": 7,
        "text": "What makes you feel most loved?"
      },
      {
        "number": 8,
        "text": "What is your favorite meal to share for a date night?"
      },
      {
        "number": 9,
        "text": "What physical and emotional gestures do you appreciate most?"
      },
      {
        "number": 10,
        "text": "What song do you think of when you think of me?"
      },
      {
        "number": 11,
        "text": "What is the main thing that you think makes a relationship last?"
      },
      {
        "number": 12,
        "text": "What experiences and situations, whether yours or someone else’s, inspired your philosophy of love?"
      }
    ]
  },
  {
    "name": "Personal",
    "questions": [
      {
        "number": 1,
        "text": "What is the extent of your religious ideology, if any?"
      },
      {
        "number": 2,
        "text": "Is there anything you would change about yourself?"
      },
      {
        "number": 3,
        "text": "What helped shape your current political stance and principles?"
      },
      {
        "number": 4,
        "text": "What are some of the things that you are most grateful for?"
      },
      {
        "number": 5,
        "text": "When was the last time you cried?"
      },
      {
        "number": 6,
        "text": "What does a perfect day look like to you?"
      },
      {
        "number": 7,
        "text": "Are there any people, from friends to relatives, you want to get closer to? Why?"
      },
      {
        "number": 8,
        "text": "Do you trust me?"
      },
      {
        "number": 9,
        "text": "Are there any conflicts that we’ve had in the past that you don’t feel are wholly resolved yet?"
      },
      {
        "number": 10,
        "text": "Which family member did you admire most when you were young?"
      },
      {
        "number": 11,
        "text": "What does a balanced relationship look like to you?"
      },
      {
        "number": 12,
        "text": "What is your idea of a healthy relationship?"
      },
      {
        "number": 13,
        "text": "Is there anything about me that you don’t currently know but want to?"
      }
    ]
  }
]
